diary/201607/3.org
#+TITLE:linux 常用命令
#+AUTHOR:ALIANG
#+EMAIL:anbgsl1110@gmail.com
#+KEYWORDS:DIARY
【aliang diary】-青春无限可能，拎得清，爱生活，爱自己
** INFO
日期：2016-07-12；作者：阿亮；关键字：笔记、linux常用命令

** "ls"命令
***** "ls"(List Directory Contents)列出文件中的内容，可能是文件也可能是文件夹
****** "ls -l"(long listing fashion)以详细模式列出文件中的内容
****** "ls -a"列出文件中所有的文件，包括以.开头的隐藏文件
** "cd"命令
- "cd" 改变工作目录
- "cd ~"跳转到root目录
- "cd ../"跳转到上层目录
** "pwd"命令
- "pwd"(print working derictory)显示当前工作目录的全路径
** "cp"命令
- "cp"(copy)复制文件的命令
** "mv"命令
- "mv"移动文件的命令
** "dd"命令
- "dd"转换和复制文件
** "lsblk"命令
- "lsblk"列出块设备，以树状结构输出
- "lsblk -l"列出块设备。以列表结构输出
** "mkdir"命令
- "mkdir"在当前路径下创建新的文件
** "touch"命令
- "touch"把文件的访问和修改更新到最新时间，当文件不存在时进行创建。已经存在会更新时间戳不会改变文本内容
** "cal"命令
- "cal"(Calender)显示当前或过去或未来的年月日历，例如："cal","cal 07 2016";
** "date"命令
- "date"标准格式输出当前日期时间
** "uname"命令
- "uname"(unix name)显示机器名，操作系统，内核等信息
** "history"命令
- "history"显示执行过命令的历史纪录
** "sudo"命令
- "sudo"(super user do)授权执行超级用户(root)或其他用户的命令
** "cat"命令
- "cat"(Concatenation)连接连个或多个文本文件或者打印输出文本内容到屏幕
